# Pandas Practice — Part 2 (Questions 21–40)

In [ ]:

import pandas as pd
import numpy as np

# Create a small demo DataFrame for selection/filtering examples
df = pd.DataFrame({
    'Name':['Alice','Bob','Charlie','David','Eva','Frank'],
    'Age':[23,35,45,29,32,40],
    'City':['New York','Paris','London','Tokyo','London','Berlin']
}, index=['row1','row2','row3','row4','row5','row6'])

df

### Q21: Select the 'Name' column.

In [ ]:
df['Name']

### Q22: Select columns 'Name' and 'Age'.

In [ ]:
df[['Name','Age']]

### Q23: Select row with label 'row1'.

In [ ]:
df.loc['row1']

### Q24: Select second row (iloc).

In [ ]:
df.iloc[1]

### Q25: Select rows from index 2 to 5 using iloc.

In [ ]:
df.iloc[2:6]

### Q26: Select value at row 'row2', column 'Age'.

In [ ]:
df.loc['row2','Age']

### Q27: Select rows 'row1' to 'row3' and columns ['Name','City'].

In [ ]:
df.loc['row1':'row3',['Name','City']]

### Q28: Display first 5 values of 'Age'.

In [ ]:
df['Age'].head(5)

### Q29: Set 'Name' as index.

In [ ]:
df2 = df.set_index('Name'); df2.head()

### Q30: Reset index back to default integers.

In [ ]:
df2.reset_index(drop=True)

### Q31: Select rows where Age > 30.

In [ ]:
df[df['Age'] > 30]

### Q32: Select rows where City == 'New York'.

In [ ]:
df[df['City'] == 'New York']

### Q33: Select rows where Age > 25 and City == 'London'.

In [ ]:
df[(df['Age'] > 25) & (df['City'] == 'London')]

### Q34: Select rows where Age < 30 or City == 'Paris'.

In [ ]:
df[(df['Age'] < 30) | (df['City'] == 'Paris')]

### Q35: Select rows where City in ['Tokyo','Moscow','Berlin'].

In [ ]:
df[df['City'].isin(['Tokyo','Moscow','Berlin'])]

### Q36: Select rows where City != 'New York'.

In [ ]:
df[df['City'] != 'New York']

### Q37: Select rows where Age is not null.

In [ ]:
df[df['Age'].notna()]

### Q38: Select rows where Age is null (none here).

In [ ]:
df[df['Age'].isna()]

### Q39: Select rows where Name starts with 'A'.

In [ ]:
df[df['Name'].str.startswith('A')]

### Q40: Use query to select Age > 22.

In [ ]:
df.query('Age > 22')